from django.db import models
from django.conf import settings
import os

block_choices = [('1', '1 блок'),
                 ('2', '2 блок')]


class File(models.Model):
    year_choices = [('2020-2021', '2020-2021'),
                    ('2021-2022', '2021-2022'),
                    ('2022-2023', '2022-2023'),
                    ('2023-2024', '2023-2024')]

    tag_choices = [
        ('common', 'Анықталмаған'),
        ('schedule', 'Кесте'),
        ('course', 'Курс'),
        ('methodist_cyclogram', 'Әдіскер циклограмасы'),
        ('mad', 'МАД'),
        ('methodist_monitoring', 'Әдіскер мониторинг'),
        ('personal_development_map', 'Жеке даму картасы'),
        ('monitoring', 'Мониторинг'),
        ('group_cyclogram', 'Топтың циклограммасы'),
        ('year_plan', 'Жалдық жоспар'),
        ('gpp', 'Топтардың перспективалық жоспарлары'),
        ('about', 'Біз туралы'),
        ('2020-2021 ж', '2020-2021 ж'),
        ('2020-2021 ж жеке даму картасы', '2020-2021 ж жеке даму картасы'),
        ('2020-2021 ж Индикаторлар', '2020-2021 ж Индикаторлар'),
        ('№1 Балбөбек тобы', '№1 Балбөбек тобы'),
        ('№2 Еркелер тобы', '№2 Еркелер тобы'),
        ('№3 Ботақан тобы', '№3 Ботақан тобы'),
        ('№4 Құлыншақ тобы', '№4 Құлыншақ тобы'),
        ('2022-2023 ж жеке даму картасы', '2022-2023 ж жеке даму картасы'),
        ('№3 Ботақан 2021-2022жыл переспективалық жоспар',
         '№3 Ботақан 2021-2022жыл переспективалық жоспар'),
        ('МАД топ мониторинг', 'МАД топ мониторинг'),
        ('Тәрбиеленушілердің топқа бөліну саны',
         'Тәрбиеленушілердің топқа бөліну саны'),
        ('№10 Балдаурен  2022-2023 ж циклограммалары',
         '№10 Балдаурен  2022-2023 ж циклограммалары'),
        ('№ 6 Бүлдіршін тобы 2022-2023 ж Циклограмма',
         '№ 6 Бүлдіршін тобы 2022-2023 ж Циклограмма'),
        ('9 Жасұлан тобы', '9 Жасұлан тобы'),
        ('№5 Балапан 2020-2021 ж циклограммалары',
         '№5 Балапан 2020-2021 ж циклограммалары'),
        ('№5 Балапан тобы', '№5 Балапан тобы'),
        ('2022-2023 ж пән жетекшісінің циклограммалары',
         '2022-2023 ж пән жетекшісінің циклограммалары'),
        ('Бөбекжайдың 2020-21ж, 2021-22ж, 2022-23ж  жылдық жоспарлары',
         'Бөбекжайдың 2020-21ж, 2021-22ж, 2022-23ж  жылдық жоспарлары'),
        ('2021-2022 ж Пән жетекшілер перспективалық жоспар',
         '2021-2022 ж Пән жетекшілер перспективалық жоспар'),
        ('№2 Еркелер тобы 2020-2021ж циклограммалары',
         '№2 Еркелер тобы 2020-2021ж циклограммалары'),
        ('Балалар контингенті 2021-2022ж', 'Балалар контингенті 2021-2022ж'),
        ('№9 Жасұлан 2022-2023 ж циклограмма',
         '№9 Жасұлан 2022-2023 ж циклограмма'),
        ('Әдіскер мониторинг 2022-23ж', 'Әдіскер мониторинг 2022-23ж'),
        ('№4 Құлыншақ тобы', '№4 Құлыншақ тобы'),
        ('№1 Балбөбек тобы 2022-2023 ж циклограммалары',
         '№1 Балбөбек тобы 2022-2023 ж циклограммалары'),
        ('2020-2021 ж жеке даму картасы', '2020-2021 ж жеке даму картасы'),
        ('№2 Еркелер 2021-2022 циклограмма', '№2 Еркелер 2021-2022 циклограмма'),
        ('Ән тех карта кіші,ортаңғы топ 2021-2022ж',
         'Ән тех карта кіші,ортаңғы топ 2021-2022ж'),
        ('№3 Ботақан топ циклограмма 2020-2021ж',
         '№3 Ботақан топ циклограмма 2020-2021ж'),
        ('Әдіскер мониторинг', 'Әдіскер мониторинг'),
        ('диплом', 'диплом'),
        ('Әдіскер циклограмма 2022-2023ж', 'Әдіскер циклограмма 2022-2023ж'),
        ('№ 5 Балапан тобы 2022-2023 ж циклограмма',
         '№ 5 Балапан тобы 2022-2023 ж циклограмма'),
        ('2022-2023 ж Индикаторлар', '2022-2023 ж Индикаторлар'),
        ('№7 Жұлдыздар тобы', '№7 Жұлдыздар тобы'),
        ('Балалар контингенті 2022-2023ж', 'Балалар контингенті 2022-2023ж'),
        ('Айлық жоспар 2020-2021ж', 'Айлық жоспар 2020-2021ж'),
        ('5 Балапан тобы', '5 Балапан тобы'),
        ('№6 Бүлдіршін тобы', '№6 Бүлдіршін тобы'),
        ('№12 Гүлдер тобы 2022-2023 ж циклограммалары',
         '№12 Гүлдер тобы 2022-2023 ж циклограммалары'),
        ('Балабақша күн тәртібі', 'Балабақша күн тәртібі'),
        ('№6 Бүлдіршін 2020-2021 ж циклограммалары',
         '№6 Бүлдіршін 2020-2021 ж циклограммалары'),
        ('№ 10 Балдаурен тобы 2021-2022 циклограмма',
         '№ 10 Балдаурен тобы 2021-2022 циклограмма'),
        ('2020-2021 ж циклограммалары', '2020-2021 ж циклограммалары'),
        ('дене шынықтыру 2021-2022 ж тех карта',
         'дене шынықтыру 2021-2022 ж тех карта'),
        ('№1 Балбөбек тобы циклограмма 2021-2022',
         '№1 Балбөбек тобы циклограмма 2021-2022'),
        ('№11  Қызғалдақ 2021-2022 ж циклограмма',
         '№11  Қызғалдақ 2021-2022 ж циклограмма'),
        ('Сабақ кесте 2020-2021ж', 'Сабақ кесте 2020-2021ж'),
        ('10 Балдаурен', '10 Балдаурен'),
        ('№9 Жасұлан тобы', '№9 Жасұлан тобы'),
        ('3 Ботақан тобы', '3 Ботақан тобы'),
        ('Айлық жоспар 2021-2022ж', 'Айлық жоспар 2021-2022ж'),
        ('№9 Жасұлан 2021-2022 ж циклограмма',
         '№9 Жасұлан 2021-2022 ж циклограмма'),
        ('№4 Құлыншақ тобы циклограмма', '№4 Құлыншақ тобы циклограмма'),
        ('2022-2023 оқу жылының циклограммалары',
         '2022-2023 оқу жылының циклограммалары'),
        ('№ 4 Құлыншақ 2022-2023 ж циклограммалары',
         '№ 4 Құлыншақ 2022-2023 ж циклограммалары'),
        ('2022-2023 о,ж  би маманының циклограммалары',
         '2022-2023 о,ж  би маманының циклограммалары'),
        ('Педагогтер туралы мәлімет', 'Педагогтер туралы мәлімет'),
        ('№2 Еркелер  циклограмма  2020-21 ж',
         '№2 Еркелер  циклограмма  2020-21 ж'),
        ('2020-2021 ж перспективалық жоспар', '2020-2021 ж перспективалық жоспар'),
        ('Педагогтердің марапаттары', 'Педагогтердің марапаттары'),
        ('1 Балбөбек тобы', '1 Балбөбек тобы'),
        ('11 Қызғалдақ тобы', '11 Қызғалдақ тобы'),
        ('2021-2022ж Жеке даму картасы', '2021-2022ж Жеке даму картасы'),
        ('2022-2023 ж Ән саз маманы циклограммалары',
         '2022-2023 ж Ән саз маманы циклограммалары'),
        ('№3 Ботақан тобы 2020-2021 ж циклограммалары',
         '№3 Ботақан тобы 2020-2021 ж циклограммалары'),
        ('№3 Ботақан  2021-2022 ж Циклограмма',
         '№3 Ботақан  2021-2022 ж Циклограмма'),
        ('2021-2022 ж перспективалық жоспар', '2021-2022 ж перспективалық жоспар'),
        ('Сабақ кесте 2022-2023ж', 'Сабақ кесте 2022-2023ж'),
        ('№1 Балбөбек циклограмма 2020-21ж', '№1 Балбөбек циклограмма 2020-21ж'),
        ('№10 Балдаурен тобы', '№10 Балдаурен тобы'),
        ('12 Гүлдер', '12 Гүлдер'),
        ('Дене шынықтыру ортаңғы топ 2021-22ж',
         'Дене шынықтыру ортаңғы топ 2021-22ж'),
        ('Дене шынықтыру 2022-2023ж  циклограммалары',
         'Дене шынықтыру 2022-2023ж  циклограммалары'),
        ('№8 Аққу тобы', '№8 Аққу тобы'),
        ('№2 Еркелер тобы', '№2 Еркелер тобы'),
        ('№11 Қызғалдақ тобы циклограммалары',
         '№11 Қызғалдақ тобы циклограммалары'),
        ('2022-2023 ж перспективалық жоспары',
         '2022-2023 ж перспективалық жоспары'),
        ('Жалпы1,2 блок қорытынды мониторинг',
         'Жалпы1,2 блок қорытынды мониторинг'),
        ('№12 Гүлдер тобы', '№12 Гүлдер тобы'),
        ('Ән тех карта ересек МАД топтар 2021-2022ж',
         'Ән тех карта ересек МАД топтар 2021-2022ж'),
        ('2020-2021 ж', '2020-2021 ж'),
        ('№9 Жасұлан 2020-2021 ж циклограмма',
         '№9 Жасұлан 2020-2021 ж циклограмма'),
        ('№8 Аққу 2020-2021 ж циклограмма', '№8 Аққу 2020-2021 ж циклограмма'),
        ('Педагогтардың санаттары', 'Педагогтардың санаттары'),
        ('Әдіскер циклограмма 2021-2022ж', 'Әдіскер циклограмма 2021-2022ж'),
        ('№1 Балбөбек тобы', '№1 Балбөбек тобы'),
        ('2020-2021 пән жетекшісі перспективалық жоспар',
         '2020-2021 пән жетекшісі перспективалық жоспар'),
        ('№5 Балапан 2021-2022 жциклограмма', '№5 Балапан 2021-2022 жциклограмма'),
        ('№2 Еркелер 2022-2023 ж циклограммалар',
         '№2 Еркелер 2022-2023 ж циклограммалар'),
        ('Сабақ кесте 2021-2022ж', 'Сабақ кесте 2021-2022ж'),
        ('№1 Балбөбек тобы 2020-2021 ж циклограммалары',
         '№1 Балбөбек тобы 2020-2021 ж циклограммалары'),
        ('№3 Ботақан тобы', '№3 Ботақан тобы'),
        ('№2 Еркелер 2021-2022 ж переспективалық жоспар',
         '№2 Еркелер 2021-2022 ж переспективалық жоспар'),
        ('№14 Айгөлек 2021-2022 ж циклограмма',
         '№14 Айгөлек 2021-2022 ж циклограмма'),
        ('Пән жетекшілер тех карта 2021-2022 ж',
         'Пән жетекшілер тех карта 2021-2022 ж'),
        ('Ән техкарта кіші ортаңғы,ересек,МАД топтар 2020-2021ж',
         'Ән техкарта кіші ортаңғы,ересек,МАД топтар 2020-2021ж'),
        ('Әдіскер циклограмма 2020-2021ж', 'Әдіскер циклограмма 2020-2021ж'),
        ('4 Құлыншақ  тобы', '4 Құлыншақ  тобы'),
        ('№11 Қызғалдақ тобы', '№11 Қызғалдақ тобы'),
        ('Әдіскер мониторинг 2021-22ж', 'Әдіскер мониторинг 2021-22ж'),
        ('2020-2021 ж пән жетекшілердің тех карта',
         '2020-2021 ж пән жетекшілердің тех карта'),
        ('Тәрбиеленушілер жетістіктері', 'Тәрбиеленушілер жетістіктері'),
        ('Балалар контингенті 2020-2021ж', 'Балалар контингенті 2020-2021ж'),
        ('2 Еркелер  тобы', '2 Еркелер  тобы'),
        ('№10 Балдаурен 2020-2021 ж циклограмма',
         '№10 Балдаурен 2020-2021 ж циклограмма'),
        ('№3 Ботақан 2022-2023 ж  циклограммалары',
         '№3 Ботақан 2022-2023 ж  циклограммалары'),
        ('14 Айгөлек', '14 Айгөлек'),
        ('Сапалық құрам 2020-2023ж аралығы', 'Сапалық құрам 2020-2023ж аралығы'),
        ('Вариативтік компонент 2021-2022', 'Вариативтік компонент 2021-2022'),
        ('№ 12  Гүлдер тобы циклограмма 2021-2022',
         '№ 12  Гүлдер тобы циклограмма 2021-2022'),
        ('Дене шынықтыру  тех карта 2020-2021 ж',
         'Дене шынықтыру  тех карта 2020-2021 ж'),
        ('2022-2023 ж дене шынықтыру циклограммалары',
         '2022-2023 ж дене шынықтыру циклограммалары'),
        ('Курстан өткен педагогтер', 'Курстан өткен педагогтер'),
        ('10 ай', '10 ай'),
        ('№ 8 Аққу 2021-2022 циклограмма', '№ 8 Аққу 2021-2022 циклограмма'),
        ('№4 Құлыншақ 2021-2022 ж циклограммалары',
         '№4 Құлыншақ 2021-2022 ж циклограммалары'),
        ('Әдіскер мониторинг 2020-2021ж', 'Әдіскер мониторинг 2020-2021ж'),
        ('2022-2023 ж пән жетекшілері перспективалық жоспар',
         '2022-2023 ж пән жетекшілері перспективалық жоспар'),
        ('8 Аққу тобы', '8 Аққу тобы'),
        ('Бөбекжай құжаттары', 'Бөбекжай құжаттары'),]


    name = models.CharField(max_length=255)
    file = models.FileField(upload_to='pdf/', max_length=255)
    tag = models.CharField(
        max_length=100, default='common', choices=tag_choices)
    year = models.CharField(max_length=10, choices=year_choices)
    block = models.CharField(max_length=10, choices=block_choices)

    def __str__(self):
        return self.name
    
    def update(self, **kwargs):
        for field, value in kwargs.items():
            setattr(self, field, value)
        self.save()

    def delete(self, *args, **kwargs):
        file_path = os.path.join(settings.MEDIA_ROOT, self.file.name)
        if os.path.exists(file_path):
            os.remove(file_path)
        super().delete(*args, **kwargs)


class Teacher(models.Model):
    first_name = models.CharField(max_length=255)
    last_name = models.CharField(max_length=255)
    middle_name = models.CharField(max_length=255, null=True, blank=True)
    birth_date = models.DateField()
    education = models.CharField(max_length=1000)
    diploma = models.FileField(upload_to='diplomas/', null=True, blank=True)
    qualification = models.CharField(max_length=255)
    position = models.CharField(max_length=255)
    experience = models.CharField(max_length=255)
    overall_experience = models.CharField(max_length=255)
    category = models.CharField(max_length=255)
    phone_number = models.CharField(max_length=12)
    image = models.ImageField(upload_to='avatars/', null=True, blank=True)
    block = models.CharField(max_length=10, choices=block_choices)

    def __str__(self):
        return f'{self.last_name} {self.first_name} {self.middle_name}'

    def update(self, **kwargs):
        for field, value in kwargs.items():
            setattr(self, field, value)
        self.save()
        
    def delete(self, *args, **kwargs):
        if self.diploma:
            diploma_path = os.path.join(settings.MEDIA_ROOT, self.diploma.name)
            if os.path.exists(diploma_path):
                os.remove(diploma_path)

        if self.image:
            avatar_path = os.path.join(settings.MEDIA_ROOT, self.image.name)
            if os.path.exists(avatar_path):
                os.remove(avatar_path)
        super().delete(*args, **kwargs)
